In [1]:
import pandas as pd
import xlrd

In [2]:
df = pd.read_excel("Canada.xlsx")
df.columns.values

array(['Type', 'Coverage', 'OdName', 'AREA', 'AreaName', 'REG', 'RegName',
       'DEV', 'DevName', 1980, 1981, 1982, 1983, 1984, 1985, 1986, 1987,
       1988, 1989, 1990, 1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998,
       1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009,
       2010, 2011, 2012, 2013], dtype=object)

In [3]:
df_new = df[['OdName', 'AreaName', 1980]]
df_new = df_new.head()
df_new

           OdName AreaName  1980
0     Afghanistan     Asia    16
1         Albania   Europe     1
2         Algeria   Africa    80
3  American Samoa  Oceania     0
4         Andorra   Europe     0

# Delete Column

In [4]:
df_new.drop(1980, axis=1)   # axis = 1 refers to Columns

           OdName AreaName
0     Afghanistan     Asia
1         Albania   Europe
2         Algeria   Africa
3  American Samoa  Oceania
4         Andorra   Europe

In [5]:
df_new

           OdName AreaName  1980
0     Afghanistan     Asia    16
1         Albania   Europe     1
2         Algeria   Africa    80
3  American Samoa  Oceania     0
4         Andorra   Europe     0

In [6]:
df_new.drop(['OdName', 'AreaName'], axis=1)   #Multiple columns need to be provided as List

   1980
0    16
1     1
2    80
3     0
4     0

In [7]:
df_new

           OdName AreaName  1980
0     Afghanistan     Asia    16
1         Albania   Europe     1
2         Algeria   Africa    80
3  American Samoa  Oceania     0
4         Andorra   Europe     0

In [8]:
df_new.columns

Index(['OdName', 'AreaName', 1980], dtype='object')

In [9]:
df_new.columns[0:2]

Index(['OdName', 'AreaName'], dtype='object')

In [10]:
df_new.drop(df_new.columns[0:2], axis=1)

   1980
0    16
1     1
2    80
3     0
4     0

In [11]:
df_new

           OdName AreaName  1980
0     Afghanistan     Asia    16
1         Albania   Europe     1
2         Algeria   Africa    80
3  American Samoa  Oceania     0
4         Andorra   Europe     0

# Delete Row

In [12]:
df_new.drop(1) #By default Axis=0 #argument value is Row Number, that value must have to be an Index

           OdName AreaName  1980
0     Afghanistan     Asia    16
2         Algeria   Africa    80
3  American Samoa  Oceania     0
4         Andorra   Europe     0

In [13]:
df_new

           OdName AreaName  1980
0     Afghanistan     Asia    16
1         Albania   Europe     1
2         Algeria   Africa    80
3  American Samoa  Oceania     0
4         Andorra   Europe     0

In [14]:
df_new.drop(2, axis=0)

           OdName AreaName  1980
0     Afghanistan     Asia    16
1         Albania   Europe     1
3  American Samoa  Oceania     0
4         Andorra   Europe     0

In [15]:
df_new

           OdName AreaName  1980
0     Afghanistan     Asia    16
1         Albania   Europe     1
2         Algeria   Africa    80
3  American Samoa  Oceania     0
4         Andorra   Europe     0

In [16]:
df_new.drop([2,4], axis=0)  #Multiple Index need to be provided as List

           OdName AreaName  1980
0     Afghanistan     Asia    16
1         Albania   Europe     1
3  American Samoa  Oceania     0

In [17]:
df_new

           OdName AreaName  1980
0     Afghanistan     Asia    16
1         Albania   Europe     1
2         Algeria   Africa    80
3  American Samoa  Oceania     0
4         Andorra   Europe     0

In [18]:
df_new.values

array([['Afghanistan', 'Asia', 16],
       ['Albania', 'Europe', 1],
       ['Algeria', 'Africa', 80],
       ['American Samoa', 'Oceania', 0],
       ['Andorra', 'Europe', 0]], dtype=object)

In [19]:
df_new.index.values

array([0, 1, 2, 3, 4], dtype=int64)

In [20]:
df_new.index.values[1:3]

array([1, 2], dtype=int64)

In [21]:
df_new.drop(df_new.index.values[1:3], axis=0)

           OdName AreaName  1980
0     Afghanistan     Asia    16
3  American Samoa  Oceania     0
4         Andorra   Europe     0

In [22]:
df_new = df_new.set_index("AreaName")

In [23]:
df_new

                  OdName  1980
AreaName
Asia         Afghanistan    16
Europe           Albania     1
Africa           Algeria    80
Oceania   American Samoa     0
Europe           Andorra     0

In [24]:
df_new.drop("O")

KeyError: "['O'] not found in axis"